In [1]:
import pandas as pd

df = pd.read_csv("data/merged2.csv")

df.head()

   Unnamed: 0        Date Freight_price  Oil_price
0           0  2025-03-01        660.00      70.88
1           1  2025-02-01        670.00      72.81
2           2  2025-01-01        662.00      75.67
3           3  2024-12-01        625.00      74.24
4           4  2024-11-01        663.00      71.84

In [9]:
df.columns

Index(['Unnamed: 0', 'Date', 'Freight_price', 'Oil_price'], dtype='object')

In [10]:
df.drop("Unnamed: 0", axis=1)

           Date Freight_price  Oil_price
0    2025-03-01        660.00      70.88
1    2025-02-01        670.00      72.81
2    2025-01-01        662.00      75.67
3    2024-12-01        625.00      74.24
4    2024-11-01        663.00      71.84
..          ...           ...        ...
269  2002-10-01        721.00      25.72
270  2002-09-01        683.00      28.75
271  2002-08-01        728.00      27.47
272  2002-07-01        742.00      25.44
273  2002-06-01        733.00      25.58

[274 rows x 3 columns]

In [11]:
df.to_csv("data/new_merged2.csv")